<a href="https://colab.research.google.com/github/jayac251/Machine_Learning/blob/main/pandas_4_descriptive_statistics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
marksUT= {'Name':['Raman','Raman','Raman','Zuhaire','Zuhaire','Zuhaire', 'Ashravy','Ashravy','Ashravy','Mishti','Mishti','Mishti'],
 'UT':[1,2,3,1,2,3,1,2,3,1,2,3],
 'Maths':[22,21,14,20,23,22,23,24,12,15,18,17],
 'Science':[21,20,19,17,15,18,19,22,25,22,21,18],
 'S.St':[18,17,15,22,21,19,20,24,19,25,25,20],
 'Hindi':[20,22,24,24,25,23,15,17,21,22,24,25],
 'Eng':[21,24,23,19,15,13,22,21,23,22,23,20]
 }

df=pd.DataFrame(marksUT)

print(df)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

## 1 .**Descriptive Statistics**

Used to summarize the given data

1.   min
2.   max
3.   count
4.   sum
5.   median
6.   mean
7.   mode
8.   quartiles
9.   variance

### **1. max**

In [ ]:
# max (calculate max value from DF, regardless its datatype)
print(df.max())

#calculate max value for columns having numeric values
print('\n', df.max(numeric_only=True))

Name       Zuhaire
UT               3
Maths           24
Science         25
S.St            25
Hindi           25
Eng             24
dtype: object

 UT          3
Maths      24
Science    25
S.St       25
Hindi      25
Eng        24
dtype: int64

In [42]:
# Write statements to output the max marks obtained in each subject in Unit 2
print(df,'\n\n')

print(df[df.loc[:,'UT']==2].max(numeric_only=True))

#print('\n\n')

#df1 = df[df.loc[:,'Name'] == 'Raman']
#print('\n\n',df1)

#df2 = df1[df1.loc[:,'UT'] == 2]
#print('\n\n',df2)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20


UT          2
Maths      24
Science    22
S.St       25
Hindi      25
Eng        24
dtype: int64

By default, the max() method finds the maximum
value of each column (which means, axis=0). However,
to find the maximum value of each row, we have to
specify axis = 1 as its argument.

In [51]:
#maximum marks for each student in each unit test among all the subjects
print(df,'\n\n')

df.max(axis = 1)

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

0     22
1     24
2     24
3     24
4     25
5     23
6     23
7     24
8     25
9     25
10    25
11    25
dtype: int64

### **2. min**

In [52]:
print(df.min())

Name       Ashravy
UT               1
Maths           12
Science         15
S.St            15
Hindi           15
Eng             13
dtype: object

In [65]:
# Write the statements to display the minimum marks obtained by a particular student ‘Mishti’ in all the unit tests for each subject.

print(df)

df1 = df[df.loc[:,'Name'] == 'Mishti']

print('\n',df1.min())

print('\n',df1[['Maths','Science','S.St','Hindi','Eng']].min())

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

 Name       Mishti
UT              1
Maths          15
Science        18
S.St           20
Hindi          22
Eng            20
dtype: object

 Maths      15
Science    18
S.St       20
Hindi      22
Eng        20
dtype: int64

### **3. sum**

In [74]:
print(df.sum())
print('\n',df[['Maths','Science','S.St','Hindi','Eng']].sum())

Name       RamanRamanRamanZuhaireZuhaireZuhaireAshravyAsh...
UT                                                        24
Maths                                                    231
Science                                                  237
S.St                                                     245
Hindi                                                    262
Eng                                                      246
dtype: object

 Maths      231
Science    237
S.St       245
Hindi      262
Eng        246
dtype: int64

In [72]:
#marks obtained by Raman in each test

df1 = df[df.loc[:,'Name'] == 'Raman']
print(df1)

print('\n', df1[['Maths','Science','S.St','Hindi','Eng']].sum())

#print marks obtained by Raman in all subjects  in each unit test
print('\n', df1[['Maths','Science','S.St','Hindi','Eng']].sum(axis=1))

    Name  UT  Maths  Science  S.St  Hindi  Eng
0  Raman   1     22       21    18     20   21
1  Raman   2     21       20    17     22   24
2  Raman   3     14       19    15     24   23

 Maths      57
Science    60
S.St       50
Hindi      66
Eng        68
dtype: int64

 0    102
1    104
2     95
dtype: int64

### **4. calculating number of values**

DataFrame.count() display the total number of values in each column or row in Dataframe. To count the rows we need to use the argument axis=1.

In [76]:
print(df)

print('\n', df.count())

# count no. of values in a row
print('\n', df.count(axis = 1))

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

 Name       12
UT         12
Maths      12
Science    12
S.St       12
Hindi      12
Eng        12
dtype: int64

 0     7
1     7
2     7
3     7
4     7
5     7
6     7
7     7
8     7
9     7
10    7
11    7
dtype: int64

### **5. Mean**

DataFrame.mean() display mean(average) of the values in each column of dataframe. 

**It is applicable only for numerical values.**

In [79]:
print(df.mean())

print('\n',df['S.St'] . mean())

UT          2.000000
Maths      19.250000
Science    19.750000
S.St       20.416667
Hindi      21.833333
Eng        20.500000
dtype: float64

 20.416666666666668

In [87]:
# Write the statements to get an average of marks obtained by Zuhaire in all the Unit Tests.

print(df)

df1 = df[df.loc[:,'Name'] == 'Zuhaire']
print('\n',df1)

print('\n',df1.mean(axis = 1))

print('\n',df1.loc[:,'Maths':'Eng'].mean(axis = 1))

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

       Name  UT  Maths  Science  S.St  Hindi  Eng
3  Zuhaire   1     20       17    22     24   19
4  Zuhaire   2     23       15    21     25   15
5  Zuhaire   3     22       18    19     23   13

 3    17.166667
4    16.833333
5    16.333333
dtype: float64

 3    20.4
4    19.8
5    19.0
dtype: float64

### **6. Median**

DataFrame.median() display the middle value of the data. This function will display the median of the values of each column of a Dataframe. 

**It is applicable only for numerical values**

In [88]:
print(df.median())

UT          2.0
Maths      20.5
Science    19.5
S.St       20.0
Hindi      22.5
Eng        21.5
dtype: float64

In [101]:
# Write the statements to print the median marks of mathematics in UT1.

print(df)

df1=df[df['UT'] == 1]

df1['Maths'].median()

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

21.0

### **7. Mode**

DateFrame.mode() will display the mode. 

The mode is defined as the value that **appears the most number of times** in a data. 

This function will display the mode of each column or row of the DataFrame.

In [102]:
df['Hindi']

0     20
1     22
2     24
3     24
4     25
5     23
6     15
7     17
8     21
9     22
10    24
11    25
Name: Hindi, dtype: int64

In [103]:
# The mode of Hindi marks

df['Hindi'].mode()

0    24
dtype: int64

### **8. Calculating Quartile**

Dataframe.quantile() is used to get the quartiles. 

It will output the quartile of each column or row of the DataFrame in four parts 

i.e. 

the first quartile is 25% (parameter q = .25), 

the second quartile is 50% (Median), 

the third quartile is 75% (parameter q = .75).

**By default, it will display the second quantile (median) of all numeric values.**

In [105]:
print(df,'\n')

df.quantile()

       Name  UT  Maths  Science  S.St  Hindi  Eng
0     Raman   1     22       21    18     20   21
1     Raman   2     21       20    17     22   24
2     Raman   3     14       19    15     24   23
3   Zuhaire   1     20       17    22     24   19
4   Zuhaire   2     23       15    21     25   15
5   Zuhaire   3     22       18    19     23   13
6   Ashravy   1     23       19    20     15   22
7   Ashravy   2     24       22    24     17   21
8   Ashravy   3     12       25    19     21   23
9    Mishti   1     15       22    25     22   22
10   Mishti   2     18       21    25     24   23
11   Mishti   3     17       18    20     25   20

UT          2.0
Maths      20.5
Science    19.5
S.St       20.0
Hindi      22.5
Eng        21.5
Name: 0.5, dtype: float64

In [106]:
df.quantile(q=.25)

UT          1.00
Maths      16.50
Science    18.00
S.St       18.75
Hindi      20.75
Eng        19.75
Name: 0.25, dtype: float64

In [107]:
df.quantile(q=.75)

UT          3.00
Maths      22.25
Science    21.25
S.St       22.50
Hindi      24.00
Eng        23.00
Name: 0.75, dtype: float64

In [118]:
# Write the statement to display the first and third quartiles of all subjects

df1=df.loc[:,'Maths':'Eng']
print(df1)

df1.quantile(q=[.25,.75])

    Maths  Science  S.St  Hindi  Eng
0      22       21    18     20   21
1      21       20    17     22   24
2      14       19    15     24   23
3      20       17    22     24   19
4      23       15    21     25   15
5      22       18    19     23   13
6      23       19    20     15   22
7      24       22    24     17   21
8      12       25    19     21   23
9      15       22    25     22   22
10     18       21    25     24   23
11     17       18    20     25   20

      Maths  Science   S.St  Hindi    Eng
0.25  16.50    18.00  18.75  20.75  19.75
0.75  22.25    21.25  22.50  24.00  23.00

### **9. Calculating Variance**

DataFrame.var() is used to display the variance. 

It is the average of squared differences from the mean.

In [121]:
df[['Maths','Science','S.St','Hindi','Eng']].var()

#or

(df.loc[:,'Maths':'Eng']).var()

Maths      15.840909
Science     7.113636
S.St        9.901515
Hindi       9.969697
Eng        11.363636
dtype: float64

### **10. Calculating Standard Deviation**


DataFrame.std() returns the standard deviation of the values.

Standard deviation is calculated as the square root of the variance.

In [124]:
df[['Maths','Science','S.St','Hindi','Eng']].std()

#or

(df.loc[:,'Maths':'Eng']).std()

Maths      3.980064
Science    2.667140
S.St       3.146667
Hindi      3.157483
Eng        3.370999
dtype: float64

##**DataFrame.describe()**

DataFrame.describe() function displays the descriptive statistical values in a  single command.

These values help us describe a set of data in a DataFrame.

In [125]:
df.describe()

              UT      Maths   Science       S.St      Hindi        Eng
count  12.000000  12.000000  12.00000  12.000000  12.000000  12.000000
mean    2.000000  19.250000  19.75000  20.416667  21.833333  20.500000
std     0.852803   3.980064   2.66714   3.146667   3.157483   3.370999
min     1.000000  12.000000  15.00000  15.000000  15.000000  13.000000
25%     1.000000  16.500000  18.00000  18.750000  20.750000  19.750000
50%     2.000000  20.500000  19.50000  20.000000  22.500000  21.500000
75%     3.000000  22.250000  21.25000  22.500000  24.000000  23.000000
max     3.000000  24.000000  25.00000  25.000000  25.000000  24.000000